spodat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Songs to pave the seasons</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="assets/style.css"/>
<link rel="icon" href="assets/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Songs to pave the seasons</h1>
<p>
I have analyzed my Spotify data<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> for the period 2016-2024. The results accurately represent
my actual music taste<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>
<div id="outline-container-orgbdecef1" class="outline-2">
<h2 id="orgbdecef1">Technical details</h2>
<div class="outline-text-2" id="text-orgbdecef1">
<p>
This is a suitable task for an array language, so I rely on <a href="https://mlochbaum.github.io/BQN/index.html">BQN</a> which is my
favorite one:
</p>

<div class="org-src-container">
<pre class="src src-bqn">⟨P⇐Parse⟩ ← •Import "../bqn-libs/json.bqn"
@ ⊣ spd ← P •file.Chars "../supp/spdat/data.json"
</pre>
</div>

<p>
Additional structural information is needed, namely index of the songs,
artists, elapsed time, and the length of the desired result.
</p>

<div class="org-src-container">
<pre class="src src-bqn">s‿a‿m‿l ← ⟨7, 8, 3, 1+↕20⟩
</pre>
</div>

<p>
We define a (50 chars) dyadic block function to execute the queries:
</p>

<div class="org-src-container">
<pre class="src src-bqn">Q ← {l≍˘∾(⍷𝕨⊸⊏˘)¨ l⊏ ((⍒(+´m⊸⊏˘)¨)⊸⊏ 𝕨⊸⊏˘⊐⊸⊔⊢) &gt;1⊏¨ 𝕩}
</pre>
</div>
</div>
</div>
<div id="outline-container-org2949cd1" class="outline-2">
<h2 id="org2949cd1">Top songs</h2>
<div class="outline-text-2" id="text-org2949cd1">
<div class="org-src-container">
<pre class="src src-bqn">s Q spd	
</pre>
</div>

<pre class="example" id="org7952330">
┌─                                                     
╵ 1  "Countless Skies"                                 
  2  "Divertimento I, K.136: Allegro"                  
  3  "The Numbers"                                     
  4  "Autre temps"                                     
  5  "Ghost of Perdition"                              
  6  "Crossing the Road Material"                      
  7  "Hoppípolla"                                      
  8  "Ether"                                           
  9  "Colossus"                                        
  10 "River"                                           
  11 "El Tete"                                         
  12 "Will o the Wisp"                                 
  13 "Pakumba"                                         
  14 "Damned Rope"                                     
  15 "Eternal Rains Will Come"                         
  16 "La femme d'argent"                               
  17 "Bajanda"                                         
  18 "Nimrodel - Medley"                               
  19 "Breathe (In The Air) - 2011 Remastered Version"  
  20 "In The Shadow Of Our Pale Companion"             
                                                      ┘
</pre>
</div>
</div>
<div id="outline-container-org6193b7a" class="outline-2">
<h2 id="org6193b7a">Top artists</h2>
<div class="outline-text-2" id="text-org6193b7a">
<div class="org-src-container">
<pre class="src src-bqn">a Q spd
</pre>
</div>

<pre class="example" id="org3788db3">
┌─                              
╵ 1  "Opeth"                    
  2  "Wolfgang Amadeus Mozart"  
  3  "Pink Floyd"               
  4  "Be'lakor"                 
  5  "Sigur Rós"                
  6  "Coldplay"                 
  7  "Mogwai"                   
  8  "Chocolate Mc"             
  9  "Radiohead"                
  10 "Joaquín Sabina"           
  11 "Iron &amp; Wine"              
  12 "Rammstein"                
  13 "Alcest"                   
  14 "Buena Fe"                 
  15 "Silvio Rodríguez"         
  16 "Amon Amarth"              
  17 "In Mourning"              
  18 "Lamb of God"              
  19 "Camel"                    
  20 "Omnium Gatherum"          
                               ┘
</pre>
</div>
</div>
<div id="outline-container-org6662f0a" class="outline-2">
<h2 id="org6662f0a">Bonus: Opeth anthology</h2>
<div class="outline-text-2" id="text-org6662f0a">
<p>
This is the Opeth album I would recommend to anyone. The query function needs to be modified a bit for generating it.
But before that, let's look at the <a href="https://www.opeth.com/releases/albums">official discography</a>:
</p>

<div class="org-src-container">
<pre class="src src-bqn">lo ← (↕∘⌈+´÷≠) 7‿5‿9‿7‿8‿6‿8‿8‿7‿10‿7‿11‿10
</pre>
</div>

<p>
Then:
</p>

<div class="org-src-container">
<pre class="src src-bqn">O ← {lo (1⊸+∘⊣≍˘⊏) (⊢˝˘⊸∊⟜𝕨/⊏˘) ∾(⍷s‿a⊸⊏˘)¨ ((⍒(+´m⊸⊏˘)¨)⊸⊏ s⊸⊏˘⊐⊸⊔⊢) &gt;1⊏¨ 𝕩}
</pre>
</div>

<p>
Enjoy:
</p>

<div class="org-src-container">
<pre class="src src-bqn">spd O˜⋈ "Opeth" 
</pre>
</div>

<pre class="example" id="orgca1b7b5">
┌─                             
╵ 1 "Ghost of Perdition"       
  2 "River"                    
  3 "Will o the Wisp"          
  4 "Eternal Rains Will Come"  
  5 "The Drapery Falls"        
  6 "Elysian Woes"             
  7 "Burden"                   
  8 "Harvest"                  
                              ┘
</pre>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
It is possible to request a detailed report of all user activity since the account was created. There are
some <a href="https://support.spotify.com/us/article/understanding-my-data/">interesting fields</a> in the data, but more advanced information, such as genre, requires querying the
Spotify Web API, which is beyond the scope of this post.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Well, modulo all from <code>Tool</code> and <code>Silent state optimizer</code> from <code>Leech</code>, which are definitely in my top ten,
and which I listen to on YouTube. It's possible to analyze the <a href="https://takeout.google.com/settings/takeout">data</a> from this site as well—perhaps in a follow-up post.
</p>

<div style="text-align: center; font-size: 2em; padding: 20px 0;">
  <a href="https://panadestein.github.io/blog/" style="text-decoration: none;">⊑∘∞</a>
</div></div></div>


</div>
</div></div>
</body>
</html>
